#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x59 (0x109 - 0xB0)
// BlueprintGeneratedClass AWS_ECS_Manager.AWS_ECS_Manager_C
class UAWS_ECS_Manager_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                TaskARN;                                           // 0xB8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                Current_Status;                                    // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                        Peak_Player_Count;                                 // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Current_Player_Count;                              // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                             Game_Start_TimeStamp;                              // 0xE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Game_Finished;                                     // 0xE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2B6F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             Game_End_TimeStamp;                                // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Server_Is_Reserved;                                // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         Server_Is_Registered;                              // 0xF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         MatchMakingCallInProgress;                         // 0xFA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2B70[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Math_Maker_Ping_Frequency;                         // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Game_Started;                                      // 0x100(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2B71[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Match_Making_Player_Count;                         // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Team_Info;                                         // 0x108(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UAWS_ECS_Manager_C* GetDefaultObj();

	void Construct_Matchmaking_Ping_Request(class UVaRestRequestJSON* Json_Request, class UVaRestJsonObject* Json_Object, bool Temp_bool_Variable, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue_1, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, bool Temp_bool_Variable_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, const class FString& CallFunc_Get_Task_Arn_TaskARN, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue_1, const struct FDateTime& K2Node_Select_Default, const struct FDateTime& K2Node_Select_Default_1, const struct FTimespan& CallFunc_Subtract_DateTimeDateTime_ReturnValue, float CallFunc_GetTotalSeconds_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, TArray<class FString>& CallFunc_Generate_Players_In_Session_String_Player_List, const class FString& CallFunc_GetProjectVersion_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void Construct_Matchmaking_Stop_Request(class UVaRestRequestJSON* Json_Request, class UVaRestJsonObject* Json_Object, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, const class FString& CallFunc_Get_Task_Arn_TaskARN, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue_1, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void Construct_Matchmaking_Join_Request(class UVaRestRequestJSON* Json_Request, class UVaRestJsonObject* Json_Object, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, const class FString& CallFunc_Get_Task_Arn_TaskARN, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Get_Current_Session_Id_Session_Id, const class FString& CallFunc_Conv_NameToString_ReturnValue, const class FString& CallFunc_GetProjectVersion_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue_1, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void Compare_Version(const class FString& Other_Version, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, const class FString& CallFunc_Replace_ReturnValue, const class FString& CallFunc_GetProjectVersion_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, const class FString& CallFunc_Replace_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1);
	void Subscribe_to_Events(class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class AAlpha_GameMode_C* CallFunc_CurrentGameMode_As_Alpha_Game_Mode, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3);
	void Get_Task_Arn(class FString* TaskARN, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue, class ULowEntryLong* CallFunc_DateTime_ToUnixTimestamp_Timestamp, const class FString& CallFunc_GUG_GetEnvironmentVariable_ReturnValue, const class FString& CallFunc_CastToString_ReturnValue, bool CallFunc_IsEmpty_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_SelectString_ReturnValue);
	void Generate_Players_In_Session_String(TArray<class FString>* Player_List, const TArray<class FString>& Players, const class FString& Players_String, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class FString>& K2Node_MakeArray_Array, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UEOS_GameInstance_C* K2Node_DynamicCast_AsEOS_Game_Instance, bool K2Node_DynamicCast_bSuccess, TArray<struct FUniqueNetIdRepl>& CallFunc_Get_Players_in_Session_Registered_Players, TArray<class FString>& CallFunc_Get_Players_in_Session_Players_Names, int32 CallFunc_Array_Length_ReturnValue_1, const class FString& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FUniqueNetIdRepl& CallFunc_Array_Get_Item_1, const class FString& CallFunc_Conv_FUniqueNetIdReplToString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void StopServer(class UVaRestRequestJSON* Request_Object, class UVaRestJsonObject* Json_Object, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue);
	void ReceiveBeginPlay();
	void Terminating_Server();
	void Started_Server();
	void Session_Created(bool Successful);
	void Server_Update_Response(class UVaRestRequestJSON* Request);
	void Register_Server();
	void Register_Server_Response(class UVaRestRequestJSON* Request);
	void Unregister_Server(bool Force, const class FString& Reason);
	void Unregister_Server_Response(class UVaRestRequestJSON* Request);
	void Ping_Matchmaking_Server();
	void Ping_Matchmaking_Server_Response(class UVaRestRequestJSON* Request);
	void ExecuteUbergraph_AWS_ECS_Manager(int32 EntryPoint, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue, bool K2Node_CustomEvent_Successful, class UVaRestRequestJSON* K2Node_CustomEvent_Request_3, class UVaRestJsonObject* CallFunc_GetRequestObject_ReturnValue, enum class EVaRestRequestStatus CallFunc_GetStatus_ReturnValue, bool CallFunc_GetBoolField_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, class UVaRestRequestJSON* K2Node_CustomEvent_Request_2, class UVaRestJsonObject* CallFunc_Get_Data_From_Response_Response_Data, enum class EVaRestRequestStatus CallFunc_GetStatus_ReturnValue_1, const class FString& CallFunc_GetStringField_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_GetBoolField_ReturnValue_1, const class FString& CallFunc_GetStringField_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, bool K2Node_CustomEvent_Force, const class FString& K2Node_CustomEvent_Reason, class UVaRestRequestJSON* K2Node_CustomEvent_Request_1, class UVaRestJsonObject* CallFunc_Get_Data_From_Response_Response_Data_1, enum class EVaRestRequestStatus CallFunc_GetStatus_ReturnValue_2, const class FString& CallFunc_GetStringField_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, class UVaRestRequestJSON* K2Node_CustomEvent_Request, class UVaRestJsonObject* CallFunc_Get_Data_From_Response_Response_Data_2, bool CallFunc_GetBoolField_ReturnValue_2, class UVaRestJsonObject* CallFunc_GetObjectField_ReturnValue, const class FString& CallFunc_GetStringField_ReturnValue_3, class UVaRestJsonObject* CallFunc_GetObjectField_ReturnValue_1, TArray<class UVaRestJsonObject*>& CallFunc_GetObjectArrayField_ReturnValue, TArray<class UVaRestJsonObject*>& CallFunc_GetObjectArrayField_ReturnValue_1, class UVaRestJsonObject* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class FString>& CallFunc_GetStringArrayField_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FST_Team_Strucutre_Info& K2Node_MakeStruct_ST_Team_Strucutre_Info, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_3, int32 CallFunc_GetIntegerField_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_GetBoolField_ReturnValue_3, enum class EVaRestRequestStatus CallFunc_GetStatus_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, const struct FDateTime& CallFunc_Now_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_WithEditor_ReturnValue, class UVaRestJsonObject* CallFunc_Array_Get_Item_1, bool CallFunc_Not_PreBool_ReturnValue_4, TArray<class FString>& CallFunc_GetStringArrayField_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, const struct FST_Team_Strucutre_Info& K2Node_MakeStruct_ST_Team_Strucutre_Info_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State_2, int32 CallFunc_Array_Add_ReturnValue_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State_3);
};

}


