#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x79 (0x2F9 - 0x280)
// BlueprintGeneratedClass BP_DeathCam.BP_DeathCam_C
class ABP_DeathCam_C : public APawn
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x280(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                      Camera;                                            // 0x288(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                   SpringArm;                                         // 0x290(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                       KillerCharacterRef;                                // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               KillerLocation;                                    // 0x2A8(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TeamID;                                            // 0x2B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Active;                                            // 0x2B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2D37[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentShipIndex;                                  // 0x2BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BoatMeshBase_C*                    CurrentSpectatingShip;                             // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Character_C*>               Characters;                                        // 0x2C8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        CurrentCharacterIndex;                             // 0x2D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2D38[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           MenuRef;                                           // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SimulatedMouseClick;                               // 0x2E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2D39[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MouseYController;                                  // 0x2EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MouseXController;                                  // 0x2F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentFOV;                                        // 0x2F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_GameModes                       GameMode;                                          // 0x2F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_DeathCam_C* GetDefaultObj();

	void CloseCurrentMenu(bool Spawn, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_1);
	void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_11(const struct FKey& Key);
	void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_10(const struct FKey& Key);
	void InpActEvt_X_K2Node_InputKeyEvent_9(const struct FKey& Key);
	void InpActEvt_P_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OC_LookAtKiller(const struct FVector& Location);
	void AttachToEntity(bool Defeated, int32 TeamID, bool Reverse);
	void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0(float AxisValue);
	void InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent_1(float AxisValue);
	void S_UpdateNetLocation(const struct FVector& Location);
	void OC_AttachToEntity(bool Defeated, int32 TeamID);
	void CloseMenu();
	void InpAxisEvt_LookUp_K2Node_InputAxisEvent_0(float AxisValue);
	void InpAxisEvt_Turn_K2Node_InputAxisEvent_1(float AxisValue);
	void InpAxisKeyEvt_Gamepad_LeftX_K2Node_InputAxisKeyEvent_0(float AxisValue);
	void InpAxisKeyEvt_Gamepad_LeftY_K2Node_InputAxisKeyEvent_1(float AxisValue);
	void OpenMenu();
	void AttachToPlayerStart();
	void OC_CloseMenu();
	void ExecuteUbergraph_BP_DeathCam(int32 EntryPoint, class AAlpha_PlayerState_C* CallFunc_Current_Alpha_Player_State_As_Alpha_Player_State, int32 Temp_int_Array_Index_Variable, const struct FKey& K2Node_InputKeyEvent_Key_3, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State_1, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, float K2Node_Event_DeltaSeconds, const struct FVector& K2Node_CustomEvent_Location_1, bool Temp_bool_Has_Been_Initd_Variable, bool K2Node_CustomEvent_Defeated_1, int32 K2Node_CustomEvent_TeamId_1, bool K2Node_CustomEvent_Reverse, float K2Node_InputAxisKeyEvent_AxisValue_3, float K2Node_InputAxisKeyEvent_AxisValue_2, bool Temp_bool_Has_Been_Initd_Variable_1, TArray<class ABP_BoatMeshBase_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, const struct FKey& K2Node_InputKeyEvent_Key_4, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_Key_IsGamepadKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool Temp_bool_IsClosed_Variable_1, bool CallFunc_BooleanOR_ReturnValue, int32 Temp_int_Array_Index_Variable_1, const struct FKey& K2Node_InputKeyEvent_Key_5, class ABP_BoatMeshBase_C* CallFunc_Array_Get_Item, bool CallFunc_IsMyShip_MyShip, const struct FKey& K2Node_InputKeyEvent_Key_6, const struct FKey& K2Node_InputKeyEvent_Key_7, bool Temp_bool_True_if_break_was_hit_Variable, const struct FVector& K2Node_CustomEvent_Location, const struct FHitResult& CallFunc_K2_SetActorLocation_SweepHitResult, bool CallFunc_K2_SetActorLocation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, int32 CallFunc_Add_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct FRotator& CallFunc_K2_GetComponentRotation_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller, bool K2Node_DynamicCast_bSuccess, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, bool CallFunc_BooleanOR_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_1, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_CustomEvent_Defeated, int32 K2Node_CustomEvent_TeamId, TArray<class ABP_Character_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, bool CallFunc_BooleanOR_ReturnValue_2, class ABP_Character_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, const struct FKey& K2Node_InputKeyEvent_Key_8, class APlayerController* CallFunc_GetPlayerController_ReturnValue_2, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_3, bool CallFunc_IsLocallyControlled_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_3, bool K2Node_DynamicCast_bSuccess_3, class APlayerController* CallFunc_GetPlayerController_ReturnValue_4, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_4, bool K2Node_DynamicCast_bSuccess_4, const struct FKey& K2Node_InputKeyEvent_Key_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue_5, int32 CallFunc_Subtract_IntInt_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_5, bool K2Node_DynamicCast_bSuccess_5, bool Temp_bool_Has_Been_Initd_Variable_2, class ABP_Character_C* CallFunc_Array_Get_Item_2, bool CallFunc_IsValid_ReturnValue_1, bool Temp_bool_IsClosed_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue_6, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_6, bool K2Node_DynamicCast_bSuccess_6, class ABP_Character_C* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_7, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_7, bool K2Node_DynamicCast_bSuccess_7, bool CallFunc_Less_IntInt_ReturnValue_1, float K2Node_InputAxisEvent_AxisValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, float K2Node_InputAxisEvent_AxisValue, class UUI_TeamMenu_C* CallFunc_Create_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UBP_GameInstance_C* K2Node_DynamicCast_AsBP_Game_Instance, bool K2Node_DynamicCast_bSuccess_8, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_BoolBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_2, const struct FKey& Temp_struct_Variable, float K2Node_InputAxisKeyEvent_AxisValue_1, float CallFunc_MapRangeClamped_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue_1, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue_1, float K2Node_Select_Default, bool CallFunc_Greater_FloatFloat_ReturnValue, float K2Node_InputAxisKeyEvent_AxisValue, bool CallFunc_GetMousePosition_Success, int32 CallFunc_GetMousePosition_X, int32 CallFunc_GetMousePosition_Y, float CallFunc_MapRangeClamped_ReturnValue_2, float CallFunc_MapRangeClamped_ReturnValue_3, bool CallFunc_Less_FloatFloat_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue_3, float K2Node_Select_Default_1, bool CallFunc_Greater_FloatFloat_ReturnValue_1, bool CallFunc_GetMousePosition_Success_1, int32 CallFunc_GetMousePosition_X_1, int32 CallFunc_GetMousePosition_Y_1, bool CallFunc_GetMousePosition_Success_2, int32 CallFunc_GetMousePosition_X_2, int32 CallFunc_GetMousePosition_Y_2, bool CallFunc_GetMousePosition_Success_3, int32 CallFunc_GetMousePosition_X_3, int32 CallFunc_GetMousePosition_Y_3, const struct FKey& K2Node_InputKeyEvent_Key_9, class APlayerController* CallFunc_GetPlayerController_ReturnValue_8, class APlayerController* CallFunc_GetPlayerController_ReturnValue_9, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_8, bool K2Node_DynamicCast_bSuccess_9, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_9, bool K2Node_DynamicCast_bSuccess_10, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_4, int32 CallFunc_Round_ReturnValue, int32 CallFunc_Round_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_2, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_1, class UBP_GameInstance_C* K2Node_DynamicCast_AsBP_Game_Instance_1, bool K2Node_DynamicCast_bSuccess_11, float CallFunc_Conv_IntToFloat_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, class UUI_ConquestPregame_C* CallFunc_Create_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_3, const struct FKey& Temp_struct_Variable_1, int32 CallFunc_Array_Add_ReturnValue, const struct FKey& K2Node_InputKeyEvent_Key, class APlayerController* CallFunc_GetPlayerController_ReturnValue_10, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_10, bool K2Node_DynamicCast_bSuccess_12, int32 CallFunc_Get_Team_ID_Team_ID, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_3, const struct FKey& K2Node_InputKeyEvent_Key_10, TArray<class APlayerStart*>& CallFunc_GetAllActorsOfClass_OutActors_2, const struct FKey& K2Node_InputKeyEvent_Key_1, class APlayerStart* CallFunc_Array_Get_Item_4, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult_1, const struct FKey& K2Node_InputKeyEvent_Key_11, class APlayerController* CallFunc_GetPlayerController_ReturnValue_11, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller_11, bool K2Node_DynamicCast_bSuccess_13, bool CallFunc_IsValid_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_3, bool CallFunc_IsLocallyControlled_ReturnValue_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue);
};

}


