#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x15C (0x37C - 0x220)
// BlueprintGeneratedClass BP_RandomItemSpawner.BP_RandomItemSpawner_C
class ABP_RandomItemSpawner_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x220(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x228(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        Items;                                             // 0x230(0x10)(Edit, BlueprintVisible)
	int32                                        RandomTier;                                        // 0x240(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier1Min;                                          // 0x244(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier2Min;                                          // 0x248(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier3Min;                                          // 0x24C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier4Min;                                          // 0x250(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier5Min;                                          // 0x254(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        Tier1Items;                                        // 0x258(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier2Items;                                        // 0x268(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier3Items;                                        // 0x278(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier4Items;                                        // 0x288(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier5Items;                                        // 0x298(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Weapons;                                           // 0x2A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        NoneCrateItems;                                    // 0x2B8(0x10)(Edit, BlueprintVisible)
	TArray<class ABP_RandomItemSpawnPoint_C*>    SpawnPoints;                                       // 0x2C8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        SpawnPointAmount;                                  // 0x2D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_395F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_RandomItemSpawnPoint_C*            SpawnPointToDelete;                                // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SpawnedItems;                                      // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3960[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_RandomItemSpawnPoint_C*>    NewSpawnPoints;                                    // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        Tier1ItemAmount;                                   // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier2ItemAmount;                                   // 0x304(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier3ItemAmount;                                   // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier4ItemAmount;                                   // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Tier5ItemAmount;                                   // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SpawnedUpgrades;                                   // 0x314(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SpawnedLootCrates;                                 // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3961[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        Tier1NoneCrateItems;                               // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier2NoneCrateItems;                               // 0x330(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier3NoneCrateItems;                               // 0x340(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier4NoneCrateItems;                               // 0x350(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        Tier5NoneCrateItems;                               // 0x360(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Ready;                                             // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3962[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OnTopOfEachotherCrates;                            // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ExplosiveBarrelsAmount;                            // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_RandomItemSpawner_C* GetDefaultObj();

	void SpawnTurnInTreasure(bool SingleTreaure, int32 SpawnedChests, class ABP_RandomItemSpawnPoint_C* SpawnPointRef, int32 Temp_int_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class ABP_PickupGoldBox_High_C* CallFunc_FinishSpawningActor_ReturnValue, class ABP_PickupGoldBox_Low_C* CallFunc_FinishSpawningActor_ReturnValue_1, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class ABP_RandomItemSpawnPoint_C* CallFunc_Array_Get_Item, int32 CallFunc_SelectInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue_1, bool K2Node_SwitchInteger_CmpSuccess);
	void RemoveAllItems(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, TArray<class ABP_Lootcrate_C*>& CallFunc_GetAllActorsOfClass_OutActors, class ABP_Lootcrate_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, TArray<class ABP_TreasureChest_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, class ABP_TreasureChest_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<class ABP_PickupBase_C*>& CallFunc_GetAllActorsOfClass_OutActors_2, int32 CallFunc_Array_Length_ReturnValue_2, class ABP_PickupBase_C* CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_2);
	void GetRandomUpgrade(class UClass** Upgrade, int32 CallFunc_RandomIntegerInRange_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess);
	void GetSurfaceSnapTransform(const struct FTransform& Transform, struct FTransform* SurfaceTransform, bool* IncorrectSpawn, int32 Temp_int_Variable, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, TArray<class AActor*>& Temp_object_Variable, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, class ABP_Lootcrate_C* K2Node_DynamicCast_AsBP_Lootcrate, bool K2Node_DynamicCast_bSuccess, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, bool CallFunc_EqualEqual_TransformTransform_ReturnValue);
	void CheckNoneCrateTier(int32 Number, TArray<class UClass*>* Tier, enum class E_Tiers* TierClass, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue_2, bool CallFunc_GreaterEqual_IntInt_ReturnValue_3);
	void SplitNoneCrateItemsInTiers(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UClass* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue_4, bool K2Node_SwitchEnum_CmpSuccess);
	void GetRandomItem(enum class E_Items* Item, int32* Amount, bool* IsWeapon, bool* Succes_, class UClass* ChosenItem, TArray<class UClass*>& CallFunc_CheckItemTier_Tier, enum class E_Tiers CallFunc_CheckItemTier_TierClass, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, class UClass* CallFunc_Array_Get_Item, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, int32 CallFunc_RandomIntegerInRange_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue_2);
	void SpawnTreasureChests(class ABP_RandomItemTreasureChestSpawnPoint_C* RandomSpawnPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, int32 CallFunc_Divide_IntInt_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, int32 CallFunc_Clamp_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_TreasureChest_C* CallFunc_FinishSpawningActor_ReturnValue, const struct FTransform& CallFunc_GetSurfaceSnapTransform_SurfaceTransform, bool CallFunc_GetSurfaceSnapTransform_IncorrectSpawn, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, TArray<class ABP_TreasureChest_C*>& CallFunc_GetAllActorsOfClass_OutActors, class ABP_TreasureChest_C* CallFunc_FinishSpawningActor_ReturnValue_1, class ABP_TreasureChest_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, TArray<class ABP_RandomItemTreasureChestSpawnPoint_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue, class ABP_RandomItemTreasureChestSpawnPoint_C* CallFunc_Array_Get_Item_1);
	void SplitItemsInTiers(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UClass* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue_4, bool K2Node_SwitchEnum_CmpSuccess);
	void SpawnItem(const struct FVector& Location, TArray<class UClass*>& ItemTier, bool Respawns, float RespawnTime, enum class E_Tiers TierClass, float RandomRotation, class UClass* ChosenItem, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, const struct FTransform& CallFunc_GetSurfaceSnapTransform_SurfaceTransform, bool CallFunc_GetSurfaceSnapTransform_IncorrectSpawn, class UClass* CallFunc_Array_Get_Item, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_RandomFloatInRange_ReturnValue_1, float CallFunc_RandomFloatInRange_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, bool CallFunc_RandomBool_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_3, const struct FTransform& CallFunc_GetSurfaceSnapTransform_SurfaceTransform_1, bool CallFunc_GetSurfaceSnapTransform_IncorrectSpawn_1, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_RandomFloatInRange_ReturnValue_4, float CallFunc_Add_FloatFloat_ReturnValue_3, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class ABP_PickupBase_C* CallFunc_FinishSpawningActor_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FTransform& CallFunc_GetSurfaceSnapTransform_SurfaceTransform_2, bool CallFunc_GetSurfaceSnapTransform_IncorrectSpawn_2, class UTexture2D* CallFunc_GetItemInfo_Icon, int32 CallFunc_GetItemInfo_Weight, class UClass* CallFunc_GetItemInfo_ItemObject, bool CallFunc_GetItemInfo_Throwable, enum class E_ItemCategories CallFunc_GetItemInfo_Category, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class ABP_PickupWeaponBase_C* K2Node_DynamicCast_AsBP_Pickup_Weapon_Base, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Variable_1, const struct FST_Weapon_Data& CallFunc_GetWeaponInfo_Out_Row, bool CallFunc_GetWeaponInfo_Found, class UTexture2D* CallFunc_GetItemInfo_Icon_1, int32 CallFunc_GetItemInfo_Weight_1, class UClass* CallFunc_GetItemInfo_ItemObject_1, bool CallFunc_GetItemInfo_Throwable_1, enum class E_ItemCategories CallFunc_GetItemInfo_Category_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2, class ABP_PickupBase_C* CallFunc_FinishSpawningActor_ReturnValue_1, class ABP_PickupBase_C* CallFunc_FinishSpawningActor_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValidClass_ReturnValue);
	void CheckItemTier(int32 Number, TArray<class UClass*>* Tier, enum class E_Tiers* TierClass, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue_2);
	void ReceiveBeginPlay();
	void SpawnChestItemAtLocation(const struct FVector& Location, enum class E_Tiers MinimumTier);
	void SpawnItems(float SpawnPointDivider, bool SpawnTurnInTreasure);
	void SpawnLootCrateItem(const struct FVector& Location);
	void SpawnRoyalChest();
	void ExecuteUbergraph_BP_RandomItemSpawner(int32 EntryPoint, int32 CallFunc_RandomIntegerInRange_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue_1, int32 CallFunc_RandomIntegerInRange_ReturnValue_2, int32 CallFunc_RandomIntegerInRange_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_RandomIntegerInRange_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class ABP_RandomWeaponSpawnPoint_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, const struct FVector& K2Node_CustomEvent_Location_1, enum class E_Tiers K2Node_CustomEvent_MinimumTier, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, float K2Node_CustomEvent_SpawnPointDivider, bool K2Node_CustomEvent_SpawnTurnInTreasure, int32 CallFunc_RandomIntegerInRange_ReturnValue_5, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue_6, float CallFunc_Divide_FloatFloat_ReturnValue, class ABP_RandomItemSpawnPoint_C* CallFunc_Array_Get_Item, int32 CallFunc_FTrunc_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, TArray<class UClass*>& CallFunc_CheckItemTier_Tier, enum class E_Tiers CallFunc_CheckItemTier_TierClass, bool CallFunc_Array_RemoveItem_ReturnValue, TArray<class ABP_RandomItemSpawnPoint_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, int32 CallFunc_Array_Length_ReturnValue_3, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass, class ABP_RandomWeaponSpawnPoint_C* CallFunc_Array_Get_Item_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_1, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_2, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_2, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_3, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_3, class UClass* Temp_class_Variable, bool CallFunc_HasAuthority_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_4, const struct FVector& K2Node_CustomEvent_Location, int32 CallFunc_RandomIntegerInRange_ReturnValue_7, bool CallFunc_RandomBool_ReturnValue, bool CallFunc_RandomBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue_8, class UClass* Temp_class_Variable_1, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_4, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_4, class UClass* Temp_class_Variable_2, int32 Temp_int_Variable_2, int32 Temp_int_Array_Index_Variable_1, class ABP_RandomItemSpawnPoint_C* CallFunc_Array_Get_Item_2, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, const struct FTransform& CallFunc_GetSurfaceSnapTransform_SurfaceTransform, bool CallFunc_GetSurfaceSnapTransform_IncorrectSpawn, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_Lootcrate_C* CallFunc_FinishSpawningActor_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_2, bool CallFunc_Array_RemoveItem_ReturnValue_1, bool CallFunc_Array_RemoveItem_ReturnValue_2, bool CallFunc_Array_RemoveItem_ReturnValue_3, TArray<class ABP_RandomItemTreasureChestSpawnPoint_C*>& CallFunc_GetAllActorsOfClass_OutActors_2, int32 CallFunc_Array_Length_ReturnValue_4, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_5, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_5, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_RandomIntegerInRange_ReturnValue_9, class ABP_RandomItemTreasureChestSpawnPoint_C* CallFunc_Array_Get_Item_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, TArray<class UClass*>& CallFunc_CheckNoneCrateTier_Tier_6, enum class E_Tiers CallFunc_CheckNoneCrateTier_TierClass_6, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class ABP_PickupGoldBox_Super_C* CallFunc_FinishSpawningActor_ReturnValue_1);
};

}


