#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x200 (0x2B0 - 0xB0)
// BlueprintGeneratedClass Buoyancy.Buoyancy_C
class UBuoyancy_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class AWaterSettings_C*                      WaterSettings;                                     // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                Owner;                                             // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                   PrimComponent;                                     // 0xC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               InitialLocation_global_;                           // 0xD0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ActorDimensions;                                   // 0xDC(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              InitialRotation;                                   // 0xE8(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        ActorHeight;                                       // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EBuoyancyModes                    BuoyancyMode;                                      // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EHullShapes                       PointsShape;                                       // 0xF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_23C4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PointsScale;                                       // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NPointsX;                                          // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NPointsY;                                          // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FloatHeight;                                       // 0x108(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NPoints;                                           // 0x10C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       Points;                                            // 0x110(0x10)(Edit, BlueprintVisible)
	TArray<struct FVector>                       PointsLocation;                                    // 0x120(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       PointsLocationPrev;                                // 0x130(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                PointsDepth;                                       // 0x140(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                PointsDepthUndeep;                                 // 0x150(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                PointsIdxToCalculate;                              // 0x160(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                PointsWaveHeight;                                  // 0x170(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                PointsUpdateCumTime;                               // 0x180(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                PointsSurfaceSpeed;                                // 0x190(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         DrawDebug;                                         // 0x1A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23C5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NPointsPerFrame;                                   // 0x1A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NFramesPause;                                      // 0x1A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FloatFactor;                                       // 0x1AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LinearDamping;                                     // 0x1B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AngularDamping;                                    // 0x1B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PointsCalculated;                                  // 0x1B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentPoint;                                      // 0x1BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Mass;                                              // 0x1C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_23C6[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ActorTransform;                                    // 0x1D0(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bAnySubmerged;                                     // 0x200(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DragMultiplier;                                    // 0x204(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ArrayIdx;                                          // 0x208(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_23C8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       DeltaPrev;                                         // 0x210(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       DeltaPrevPrev;                                     // 0x220(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        NPausedFrames;                                     // 0x230(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxAmplitude;                                      // 0x234(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableBuoyancy;                                    // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23C9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ArrayElem;                                         // 0x23C(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PtLoc;                                             // 0x248(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_23CA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x258(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             PointsOffset;                                      // 0x260(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bAnyEmerged;                                       // 0x268(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23CB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EmergedPoints;                                     // 0x26C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WaveHeightMultiplier;                              // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FrontEmerged;                                      // 0x274(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         BackEmerged;                                       // 0x275(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23CC[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EmergedFrontPoints;                                // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        EmergedBackPoints;                                 // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       ResultingPoints;                                   // 0x280(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FST_PointsWithHeight>          PointsWithHeight;                                  // 0x290(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                WaterHeights;                                      // 0x2A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UBuoyancy_C* GetDefaultObj();

	void GenCircPts(float Phi_Increment, float Ry_Increment, float Rx_Increment, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, int32 Temp_int_Variable, const struct FVector& Temp_struct_Variable, float CallFunc_Conv_IntToFloat_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_MultiplyByPi_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 Temp_int_Variable_1, float CallFunc_Conv_IntToFloat_ReturnValue_4, float K2Node_MathExpression_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_1, float K2Node_MathExpression_ReturnValue_1, float CallFunc_Lerp_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, float K2Node_MathExpression_ReturnValue_2, float K2Node_MathExpression_ReturnValue_3, float K2Node_MathExpression_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, int32 CallFunc_Array_Add_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue_3, float CallFunc_Divide_FloatFloat_ReturnValue_4);
	void GenRectangularPoints(float Y_Start, float X_Start, float Y_Increment, float X_Increment, int32 Temp_int_Variable, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float K2Node_MathExpression_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_Multiply_FloatFloat_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, float K2Node_MathExpression_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float K2Node_MathExpression_ReturnValue_2, int32 Temp_int_Variable_1, float CallFunc_Conv_IntToFloat_ReturnValue_3, float K2Node_MathExpression_ReturnValue_3, bool CallFunc_LessEqual_IntInt_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_1);
	void MeshDimensions(class AActor* Self2, struct FVector* Dimensions, class AActor* Self_2_loc, const struct FVector& MaxDim, const struct FVector& MinDim, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, TArray<class USkeletalMeshComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, TArray<class UStaticMeshComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue_1, class USkeletalMeshComponent* CallFunc_Array_Get_Item, class UStaticMeshComponent* CallFunc_Array_Get_Item_1, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, const struct FVector& CallFunc_GetLocalBounds_Min, const struct FVector& CallFunc_GetLocalBounds_Max, const struct FVector& CallFunc_NegateVector_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, float CallFunc_BreakVector_X_5, float CallFunc_BreakVector_Y_5, float CallFunc_BreakVector_Z_5, float CallFunc_FMax_ReturnValue, float CallFunc_FMin_ReturnValue, float CallFunc_FMin_ReturnValue_1, float CallFunc_FMin_ReturnValue_2, float CallFunc_FMax_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_FMax_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_BreakVector_X_6, float CallFunc_BreakVector_Y_6, float CallFunc_BreakVector_Z_6, float CallFunc_BreakVector_X_7, float CallFunc_BreakVector_Y_7, float CallFunc_BreakVector_Z_7, float CallFunc_FMax_ReturnValue_3, float CallFunc_FMin_ReturnValue_3, float CallFunc_FMin_ReturnValue_4, float CallFunc_FMin_ReturnValue_5, float CallFunc_FMax_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue_2, float CallFunc_FMax_ReturnValue_5, const struct FVector& CallFunc_MakeVector_ReturnValue_3, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue);
	void RotatorFromNormal(const struct FVector& Normal, struct FRotator* Rotation, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Cross_VectorVector_ReturnValue, float CallFunc_VSize_ReturnValue, float CallFunc_DegAsin_ReturnValue, const struct FRotator& CallFunc_RotatorFromAxisAndAngle_ReturnValue);
	void ReceiveTick(float DeltaSeconds);
	void Init();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Buoyancy(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float Temp_float_Variable, float K2Node_Event_DeltaSeconds, TArray<class AWaterSettings_C*>& CallFunc_GetAllActorsOfClass_OutActors, class AActor* CallFunc_GetOwner_ReturnValue, class AWaterSettings_C* CallFunc_Array_Get_Item, int32 Temp_int_Variable_1, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector& CallFunc_CalculateDeltaNormal_Delta, const struct FVector& CallFunc_CalculateDeltaNormal_Normal, const struct FRotator& CallFunc_RotatorFromNormal_Rotation, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, const struct FRotator& CallFunc_ComposeRotators_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorLocationAndRotation_SweepHitResult, bool CallFunc_K2_SetActorLocationAndRotation_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FVector& CallFunc_MeshDimensions_Dimensions, bool K2Node_SwitchEnum_CmpSuccess_2, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, int32 Temp_int_Variable_2, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Variable_3, float CallFunc_GetWorldDeltaSeconds_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, float CallFunc_Array_Get_Item_1, float CallFunc_Array_Get_Item_2, bool CallFunc_NotEqual_FloatFloat_ReturnValue, float CallFunc_Array_Get_Item_3, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_FloatFloat_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_5, int32 CallFunc_MaxOfFloatArray_IndexOfMaxValue, float CallFunc_MaxOfFloatArray_MaxValue, bool CallFunc_Greater_FloatFloat_ReturnValue, const struct FVector& CallFunc_Array_Get_Item_5, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, const struct FVector& CallFunc_Array_Get_Item_6, float CallFunc_Array_Get_Item_7, float CallFunc_Array_Get_Item_8, const struct FVector& CallFunc_Array_Get_Item_9, const struct FVector& CallFunc_Array_Get_Item_10, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, float CallFunc_BreakVector_X_5, float CallFunc_BreakVector_Y_5, float CallFunc_BreakVector_Z_5, float CallFunc_GetWorldDeltaSeconds_ReturnValue_1, float K2Node_MathExpression_ReturnValue, const struct FVector& CallFunc_Array_Get_Item_11, int32 Temp_int_Array_Index_Variable, const struct FVector& CallFunc_Array_Get_Item_12, int32 CallFunc_RandomIntegerInRange_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_6, const struct FVector& CallFunc_TransformLocation_ReturnValue, float CallFunc_BreakVector_X_6, float CallFunc_BreakVector_Y_6, float CallFunc_BreakVector_Z_6, const struct FVector& CallFunc_Array_Get_Item_13, float CallFunc_BreakVector_X_7, float CallFunc_BreakVector_Y_7, float CallFunc_BreakVector_Z_7, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, const struct FVector2D& CallFunc_Add_Vector2DVector2D_ReturnValue, const struct FVector& CallFunc_Array_Get_Item_14, int32 Temp_int_Loop_Counter_Variable_1, float CallFunc_BreakVector_X_8, float CallFunc_BreakVector_Y_8, float CallFunc_BreakVector_Z_8, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Variable_4, float CallFunc_Array_Get_Item_15, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_Less_FloatFloat_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, float Temp_float_Variable_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue_1, class UPrimitiveComponent* K2Node_DynamicCast_AsPrimitive_Component, bool K2Node_DynamicCast_bSuccess, class UPrimitiveComponent* K2Node_DynamicCast_AsPrimitive_Component_1, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_GetMass_ReturnValue, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_NotEqual_ByteByte_ReturnValue_1, float CallFunc_Array_Get_Item_16, bool CallFunc_Less_FloatFloat_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_7, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_5, bool CallFunc_Greater_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, float CallFunc_Array_Get_Item_17, const struct FVector& CallFunc_Array_Get_Item_18, float K2Node_MathExpression_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_5, float CallFunc_Multiply_FloatFloat_ReturnValue_6, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_6, bool CallFunc_Greater_IntInt_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue_7, float CallFunc_SelectFloat_ReturnValue, float CallFunc_SelectFloat_ReturnValue_1, float CallFunc_Array_Get_Item_19, const struct FVector& CallFunc_CalculateDeltaOnly_Delta, const struct FVector& CallFunc_NegateVector_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_8, float CallFunc_BreakVector_X_9, float CallFunc_BreakVector_Y_9, float CallFunc_BreakVector_Z_9, float CallFunc_Add_FloatFloat_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_9, float K2Node_MathExpression_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_6, int32 Temp_int_Array_Index_Variable_3, float CallFunc_Array_Get_Item_20, float CallFunc_Add_FloatFloat_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_7, int32 CallFunc_Array_Length_ReturnValue_10, bool CallFunc_Greater_IntInt_ReturnValue_8, int32 CallFunc_Array_Length_ReturnValue_11, bool CallFunc_Greater_IntInt_ReturnValue_9, int32 CallFunc_Array_Length_ReturnValue_12, int32 Temp_int_Loop_Counter_Variable_3, bool CallFunc_Greater_IntInt_ReturnValue_10, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_8, int32 CallFunc_Array_Length_ReturnValue_13, bool CallFunc_Greater_IntInt_ReturnValue_11, int32 CallFunc_Add_IntInt_ReturnValue_9, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_10, bool CallFunc_Greater_IntInt_ReturnValue_12, int32 CallFunc_Add_IntInt_ReturnValue_11, bool CallFunc_Less_IntInt_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_5);
};

}


