#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2F3 (0x3A3 - 0xB0)
// BlueprintGeneratedClass InventoryTracker.InventoryTracker_C
class UInventoryTracker_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<int32, int32>                           ItemIds;                                           // 0xB8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                DLCIds;                                            // 0x108(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, int32>                           Newest_Items;                                      // 0x118(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                Newest_DLCs;                                       // 0x168(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_BaseController_C*                  Controller;                                        // 0x178(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            New_DLC_Items_Received;                            // 0x180(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            New_Items_Received;                                // 0x190(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FST_InventoryTrackingItem>     Inventory;                                         // 0x1A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         NewItemsAvailable;                                 // 0x1B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2C80[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            Finished_Loading_Inventory;                        // 0x1B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            Opened_Chest_Event;                                // 0x1C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<int32>                                Latest_rewards;                                    // 0x1D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FST_FilterOptions                     Global_Filter_Options;                             // 0x1E8(0x20)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_NewSortOptions                    Global_Sort_Options;                               // 0x208(0x3)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2C81[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FString, int32>                   EOS_Bundle_to_Item_ID;                             // 0x210(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        Working_Item_IDs;                                  // 0x260(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        Working_DLC_IDs;                                   // 0x270(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class E_ChestTypes, int32>         Chest_Count;                                       // 0x280(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            Chest_Data_Changed;                                // 0x2D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         Has_Skeleton_DLC;                                  // 0x2E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2C82[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Event_Chest_Count;                                 // 0x2E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class E_ChestTypes, int32>         Chest_Type_To_ID_Mapping;                          // 0x2E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, enum class E_ChestTypes>         Chest_ID_to_Type_mapping;                          // 0x338(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Replicated_Latest_Rewards;                         // 0x388(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2C83[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                Valid_Item_Ids;                                    // 0x390(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Disable_Starting_Items;                            // 0x3A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         Disable_Level_Items;                               // 0x3A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         Disable_DLC_Items;                                 // 0x3A2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UInventoryTracker_C* GetDefaultObj();

	void Give_Specific_Level_Items(TArray<int32>& Levels_Gained, TMap<int32, int32> Items_to_add, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable, TArray<class FName>& CallFunc_GetDataTableRowNames_OutRowNames, int32 CallFunc_Array_Length_ReturnValue, class FName CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const struct FST_NewEOSInventoryItem& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue);
