#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA2F0 (0xA5A8 - 0x2B8)
// AnimBlueprintGeneratedClass Mannequin_AnimationBlueprint.Mannequin_AnimationBlueprint_C
class UMannequin_AnimationBlueprint_C : public UAnimInstance
{
public:
	uint8                                        Pad_2EFA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_134;                      // 0x2C8(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x3D0(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x3F0(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_133;                      // 0x410(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_132;                      // 0x518(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_131;                      // 0x620(0x108)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x728(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0x7D8(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0x930(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_130;                      // 0x958(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_129;                      // 0xA60(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_128;                      // 0xB68(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_127;                      // 0xC70(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_126;                      // 0xD78(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_125;                      // 0xE80(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0xF88(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0xFA8(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_124;                      // 0xFD0(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x10D8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_123;                      // 0x10F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_122;                      // 0x1200(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_121;                      // 0x1308(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_120;                      // 0x1410(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_119;                      // 0x1518(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_118;                      // 0x1620(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_117;                      // 0x1728(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_116;                      // 0x1830(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_115;                      // 0x1938(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_114;                      // 0x1A40(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_113;                      // 0x1B48(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_112;                      // 0x1C50(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_111;                      // 0x1D58(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_110;                      // 0x1E60(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_109;                      // 0x1F68(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_108;                      // 0x2070(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_107;                      // 0x2178(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x2280(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x22A0(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0x22C0(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_106;                      // 0x22E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_105;                      // 0x23F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_104;                      // 0x24F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_103;                      // 0x2600(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_102;                      // 0x2708(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_101;                      // 0x2810(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_100;                      // 0x2918(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x2A20(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0x2A40(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_99;                       // 0x2A68(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x2B70(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_98;                       // 0x2B90(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_97;                       // 0x2C98(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_96;                       // 0x2DA0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_95;                       // 0x2EA8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_94;                       // 0x2FB0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_93;                       // 0x30B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_92;                       // 0x31C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_91;                       // 0x32C8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_90;                       // 0x33D0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_89;                       // 0x34D8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_88;                       // 0x35E0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_87;                       // 0x36E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_86;                       // 0x37F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_85;                       // 0x38F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_84;                       // 0x3A00(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_83;                       // 0x3B08(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_82;                       // 0x3C10(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_81;                       // 0x3D18(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_80;                       // 0x3E20(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_79;                       // 0x3F28(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_78;                       // 0x4030(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_77;                       // 0x4138(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_76;                       // 0x4240(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_75;                       // 0x4348(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_74;                       // 0x4450(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_73;                       // 0x4558(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_72;                       // 0x4660(0x108)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x4768(0xC0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x4828(0x80)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_71;                       // 0x48A8(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x49B0(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x49D0(0x20)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x49F0(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x4AA0(0xB0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_70;                       // 0x4B50(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_69;                       // 0x4C58(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4D60(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4D80(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x4DA0(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_68;                       // 0x4DC8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_67;                       // 0x4ED0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_66;                       // 0x4FD8(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x50E0(0x80)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_65;                       // 0x5160(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_64;                       // 0x5268(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_63;                       // 0x5370(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_62;                       // 0x5478(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_61;                       // 0x5580(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_60;                       // 0x5688(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_59;                       // 0x5790(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_58;                       // 0x5898(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_57;                       // 0x59A0(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x5AA8(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_56;                       // 0x5AD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_55;                       // 0x5BD8(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x5CE0(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_54;                       // 0x5D08(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_53;                       // 0x5E10(0x108)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x5F18(0x158)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x6070(0x30)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_52;                       // 0x60A0(0x108)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x61A8(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x6268(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x63C0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x63E8(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_51;                       // 0x6410(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_50;                       // 0x6518(0x108)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x6620(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_49;                       // 0x6668(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_48;                       // 0x6770(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6878(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x6898(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_47;                       // 0x68C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_46;                       // 0x69C8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_45;                       // 0x6AD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_44;                       // 0x6BD8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_43;                       // 0x6CE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_42;                       // 0x6DE8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_41;                       // 0x6EF0(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x6FF8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x7020(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x7048(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x7070(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x7098(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x70C0(0x158)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_40;                       // 0x7218(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_39;                       // 0x7320(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x7428(0x80)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_38;                       // 0x74A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_37;                       // 0x75B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_36;                       // 0x76B8(0x108)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x77C0(0xA0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_35;                       // 0x7860(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_34;                       // 0x7968(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x7A70(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x7A98(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x7AB8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_33;                       // 0x7AD8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_32;                       // 0x7BE0(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x7CE8(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x7D08(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_31;                       // 0x7D30(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_30;                       // 0x7E38(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_29;                       // 0x7F40(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_28;                       // 0x8048(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_27;                       // 0x8150(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_26;                       // 0x8258(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_25;                       // 0x8360(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x8468(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x8490(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x84B8(0x158)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_24;                       // 0x8610(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_23;                       // 0x8718(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_22;                       // 0x8820(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_21;                       // 0x8928(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_20;                       // 0x8A30(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_19;                       // 0x8B38(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_18;                       // 0x8C40(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_17;                       // 0x8D48(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_16;                       // 0x8E50(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_15;                       // 0x8F58(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_14;                       // 0x9060(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13;                       // 0x9168(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_12;                       // 0x9270(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_11;                       // 0x9378(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_10;                       // 0x9480(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0x9588(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0x9690(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0x9798(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x98A0(0x80)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x9920(0xA0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0x99C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x9AC8(0x108)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x9BD0(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x9C90(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x9DE8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x9E10(0x28)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x9E38(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x9E80(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x9FD8(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0xA000(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xA108(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xA128(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0xA148(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0xA250(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0xA358(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0xA460(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0xA488(0x108)(None)
	enum class E_BodyTypes                       BodyType;                                          // 0xA590(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PegLeg;                                            // 0xA591(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2EFB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RandomStartPos;                                    // 0xA594(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_CharacterFigure                 CharacterFigure;                                   // 0xA598(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseCustomAnimation;                                // 0xA599(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2EFC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     CustomAnimation;                                   // 0xA5A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UMannequin_AnimationBlueprint_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mannequin_AnimationBlueprint_AnimGraphNode_BlendListByBool_EBC3274C4D21A687AA1DCD9CE081E129();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_Mannequin_AnimationBlueprint(int32 EntryPoint, float CallFunc_RandomFloatInRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
};

}


