#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x160 - 0xB0)
// BlueprintGeneratedClass PlayerTracker.PlayerTracker_C
class UPlayerTracker_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_BaseController_C*                  Controller;                                        // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               SteamEcoManagerRef;                                // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RequiredExperiencePerLevel;                        // 0xC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2539[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             StartPlayTime;                                     // 0xD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerTrackerExperience_Data      Experience_Data;                                   // 0xD8(0x4B)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	uint8                                        Pad_253A[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         DisableProgression;                                // 0x128(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UsedQuickPlay;                                     // 0x129(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class E_GameModes                       GameMode;                                          // 0x12A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsPartyLeader;                                     // 0x12B(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_253B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            Received_Player_Experience_Data;                   // 0x130(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         HasExperience_Data;                                // 0x140(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_253C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                Last_Received_Levels;                              // 0x148(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Replicated_Last_Received_Levels;                   // 0x158(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_253D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Attempt_count;                                     // 0x15C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UPlayerTracker_C* GetDefaultObj();

	void Reset_Last_Received_Levels();
	void Add_Game_Played(enum class E_GameModes GameMode, bool Won, bool Cursed, TArray<int32>* GainedLevels, int32 Con_Games_Won, int32 Con_Games_Played, bool Won_Conquest_Game, bool Won_Cursed_Game, int32 Cursed_Games_Won, int32 Cursed_Games_Played, bool Won_BR_Game, int32 BR_Games_Won, int32 BR_Games_Played, bool K2Node_SwitchEnum_CmpSuccess, int32 Temp_int_Variable, int32 Temp_int_Variable_1, TArray<int32>& CallFunc_Process_XP_and_Write_Player_and_Match_Data_to_Server_GainedLevels, int32 Temp_int_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, const struct FST_PlayerTrackerExperience_Data& K2Node_MakeStruct_ST_PlayerTrackerExperience_Data);
	void CheckForEXPFarming(int32 ScoreGained, int32 Duration, float XpPerMinuteTreshold, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, class UBP_GameInstance_C* K2Node_DynamicCast_AsBP_Game_Instance, bool K2Node_DynamicCast_bSuccess, class UUI_DisconnectPopup_C* CallFunc_Custom_Popup_UI_element, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue);
	void OnRep_Experience_Data(const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3);
	void ProcessLevelRewards(const struct FST_PlayerTrackerExperience_Data& ExperienceData, TArray<int32>* GainedLevels, TArray<int32>& CallFunc_GetGainedlevelsArray_GainedLevels, bool CallFunc_WithEditor_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void ProcessPlayerDataFromServer(class UVaRestRequestJSON* Response, class UVaRestJsonObject* VaRestResponse, class UVaRestJsonObject* CallFunc_GetResponseObject_ReturnValue, const class FString& CallFunc_EncodeJsonToSingleString_ReturnValue, enum class EVaRestRequestStatus CallFunc_GetStatus_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UVaRestJsonObject* CallFunc_GetResponseObject_ReturnValue_1, const class FString& CallFunc_GetStringField_ReturnValue, TArray<class UVaRestJsonObject*>& CallFunc_GetObjectArrayField_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, class UVaRestJsonObject* CallFunc_Array_Get_Item, bool CallFunc_Greater_IntInt_ReturnValue, const class FString& CallFunc_GetStringField_ReturnValue_1, const class FString& CallFunc_GetStringField_ReturnValue_2, const class FString& CallFunc_GetStringField_ReturnValue_3, int32 CallFunc_Conv_StringToInt_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue_2, const class FString& CallFunc_GetStringField_ReturnValue_4, const class FString& CallFunc_GetStringField_ReturnValue_5, int32 CallFunc_Conv_StringToInt_ReturnValue_3, int32 CallFunc_Conv_StringToInt_ReturnValue_4, const class FString& CallFunc_GetStringField_ReturnValue_6, const class FString& CallFunc_GetStringField_ReturnValue_7, int32 CallFunc_Conv_StringToInt_ReturnValue_5, int32 CallFunc_Conv_StringToInt_ReturnValue_6, const class FString& CallFunc_GetStringField_ReturnValue_8, const class FString& CallFunc_GetStringField_ReturnValue_9, int32 CallFunc_Conv_StringToInt_ReturnValue_7, int32 CallFunc_Conv_StringToInt_ReturnValue_8, const struct FST_PlayerTrackerExperience_Data& K2Node_MakeStruct_ST_PlayerTrackerExperience_Data, const struct FST_PlayerTrackerExperience_Data& K2Node_MakeStruct_ST_PlayerTrackerExperience_Data_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void ReadPlayerFromServer(const class FString& Url_Extension, class UVaRestJsonObject* Json_Object, class UVaRestRequestJSON* Json_Request, int32 Temp_int_Variable, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, const class FString& CallFunc_Get_Primary_Account_ID_Account_ID, bool CallFunc_IsEmpty_ReturnValue, class AEOS_PlayerState_C* K2Node_DynamicCast_AsEOS_Player_State, bool K2Node_DynamicCast_bSuccess, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance_1, bool CallFunc_IsEmpty_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue);
	void WriteMatchDetailsToServer(class UVaRestJsonObject* Json_Score_Object, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class AEOS_PlayerState_C* K2Node_DynamicCast_AsEOS_Player_State, bool K2Node_DynamicCast_bSuccess, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, bool CallFunc_WithEditor_ReturnValue, int32 CallFunc_GetPlayTime_playTime, int32 CallFunc_Conv_BoolToInt_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue_1, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_GetPlayTime_playTime_1);
	void ProcessScoreGained(TArray<int32>* GainedLevels, const struct FST_PlayerTrackerExperience_Data& Temp_Player_Experience_Data, TArray<int32>& CallFunc_ProcessLevelRewards_GainedLevels, int32 CallFunc_Subtract_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FST_PlayerTrackerExperience_Data& K2Node_MakeStruct_ST_PlayerTrackerExperience_Data, int32 CallFunc_Divide_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class ABP_PlayerState_C* K2Node_DynamicCast_AsBP_Player_State, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetScore_Score, int32 CallFunc_Add_IntInt_ReturnValue);
	void WritePlayerToServer(const class FString& First_Seen, class UVaRestRequestJSON* Json_Request, class UVaRestJsonObject* Json_Score_Object, class UEOS_GameInstance_C* CallFunc_Current_Game_EOS_Instance_AsEOS_Game_Instance, bool CallFunc_WithEditor_ReturnValue, const class FString& CallFunc_GetPlayerName_ReturnValue, class AEOS_PlayerState_C* K2Node_DynamicCast_AsEOS_Player_State, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_RegexReplace_ReturnValue, const class FString& CallFunc_Conv_FUniqueNetIdReplToString_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue_1, const class FString& CallFunc_DateTime_ToString_String, const class FString& CallFunc_DateTime_ToString_String_1, const class FString& CallFunc_EncodeJsonToSingleString_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class UVaRestJsonObject* CallFunc_ConstructVaRestJsonObject_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class UVaRestSubsystem* CallFunc_GetEngineSubsystem_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, class UVaRestRequestJSON* CallFunc_ConstructVaRestRequestExt_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_IsEmpty_ReturnValue);
	void SetStartPlayTimeNow(const struct FDateTime& CallFunc_Now_ReturnValue);
	void Process_XP_and_Write_Player_and_Match_Data_to_Server(bool DontRewardXP, TArray<int32>* GainedLevels, class UVaRestJsonObject* Json_Score_Object, TArray<int32>& CallFunc_ProcessScoreGained_GainedLevels);
	void GetPlayTime(int32* PlayTime, const struct FDateTime& CallFunc_Now_ReturnValue, const struct FTimespan& CallFunc_Subtract_DateTimeDateTime_ReturnValue, float CallFunc_GetTotalMinutes_ReturnValue, int32 CallFunc_FFloor_ReturnValue);
	void SetStartPlayTime(const struct FDateTime& StartTime);
	void StartTracking(const struct FDateTime& CallFunc_Now_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller, bool K2Node_DynamicCast_bSuccess);
	void OC_Show_Levels(TArray<int32>& Received_Levels);
	void ReceiveBeginPlay();
	void Initialize();
	void ExecuteUbergraph_PlayerTracker(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, TArray<int32>& K2Node_CustomEvent_Received_Levels, class ABP_BaseController_C* K2Node_DynamicCast_AsBP_Base_Controller, bool K2Node_DynamicCast_bSuccess);
	void Received_Player_Experience_Data__DelegateSignature(const struct FST_PlayerTrackerExperience_Data& Experience_Data);
};

}


