#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xB1 (0xB1 - 0x0)
// UserDefinedStruct ST_CommandPingInfo.ST_CommandPingInfo
struct FST_CommandPingInfo
{
public:
	struct FSlateBrush                           Icon_2_D3370E0D480AF1D6A3CEDEBB5578247E;           // 0x0(0x88)(Edit, BlueprintVisible)
	class AActor*                                Parent_5_58283D224CF0FEEE7EDA3987E0EB14CB;         // 0x88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Offset_8_782301DC4D2FF45A2782B4A0B73EAA83;         // 0x90(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Scale_11_917B505845CF2CB8C21EC5BD932E222D;         // 0x9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Opacity_13_CD29A7FA46B81EAB5CC746A8F1DDCC8C;       // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LifeTime_16_038B0E4548B6D60B0F243EAEC732D374;      // 0xA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SpawnAnimTime_19_45EF5C4F48152B2D1C742099EA3D51B5; // 0xA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DestroyAnimTime_21_D796ED8743ED18C6C727E29E6664BE45; // 0xAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FlipIconHorizontally_23_8D3342654A6551C4E5B3EAB8708F2F53; // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


