#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xB2 (0xB2 - 0x0)
// UserDefinedStruct St_ComplexMessage.St_ComplexMessage
struct FSt_ComplexMessage
{
public:
	class FText                                  Username_4_3345D7014ED03DC0FCE70A9E915E04BF;       // 0x0(0x18)(Edit, BlueprintVisible)
	struct FLinearColor                          UsernameColor_9_CDC0AF814EA89B3288DF89BAE3A83947;  // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  ChatMessage_10_3551ACBA4D136E5EE12F058ADBE2D73D;   // 0x28(0x18)(Edit, BlueprintVisible)
	bool                                         NotificationSound_18_5919F0074E40A93B1CEB90AA0C801DF1; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SpecialMessage_12_419C1AA244890A10C79997A30452DABD; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_226D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        SpecialMessageFont_21_93BD862749AE02876F95F9BDCBDC2249; // 0x48(0x58)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                          SpecialMessageColor_24_202558A24DA387704E4512B2DB1AC32B; // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         KillFeed_27_BB39CFF84BC2E375C2096094A1D6FA7E;      // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         TeamChatMessage_29_FFEE15084B806C411D4F82AE8ECED125; // 0xB1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


