#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x68 (0x68 - 0x0)
// UserDefinedStruct ST_CurseReward.ST_CurseReward
struct FST_CurseReward
{
public:
	class UTexture2D*                            Icon_3_013E4CA140F04AA80445F884A570E2A6;           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SpectralBurden__8_984776454190A802C5845382CE3ED7EF; // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_23CD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           Mesh_5_AC46F1BC42E4359235A55B9E915B68FB;           // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                         SkeletalMesh_29_C2D968C44238849262CD7882CD4C1A6F;  // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SkeletonAttachBoneOrSocketName_23_183111DE4CAA3317423ED5AB5BF5FFBD; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RequiredWins_19_D385DA1C4EA6712D69405BBC46119262;  // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_23CE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform_26_50F7177E4BD8092546FB9A8B20B4A30A;     // 0x30(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UAnimSequence*                         Animation_33_89D45DB7413458321C9AF7A171D074E3;     // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


