#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x74 (0x74 - 0x0)
// UserDefinedStruct ST_ShipCustomisations.ST_ShipCustomisations
struct FST_ShipCustomisations
{
public:
	int32                                        SpecialFlag_140_3598D7E34AF1707A7B5C74A16FC7D5F9;  // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ShipSailColor_18_8C5372F643CD7BE1F1B61197EC01E98F; // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BowHead_17_58B4123C48A58809B133739280548F05;       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SailEmblem_63_0D946D2349D189E2A5F136B6890A6C5E;    // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ShipHullColorSet_29_832EDDC049A2563C7A8008B9F328C88C; // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        FlagColorSet_33_0C0AD4A1412C0B4D0F35D9A46EAFDF13;  // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RopeColor_36_6A44F6D84B65D7CB8884CC93513DF7D4;     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2893[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ShipName_39_C746DA084E10CD3FDF1C4C859B240401;      // 0x20(0x18)(Edit, BlueprintVisible)
	int32                                        FlagEmblem_42_4FE4539A4210800631A88AB535B3BB36;    // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LampColor_61_B512A5444920D0C2022AC484D81ACFC3;     // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SailEmblemBottom_71_83303D6248EF41170568E69ADD7CDC99; // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SailColorBottom_72_593CED7E48E2B8F53F6DC4AE505C8F5C; // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ShipPaint_75_CEA3DD924B038F67E5F74ABE55426EEE;     // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ShipPaintColor_114_2FD668AB4CD6C4C273C9F6A8D2DEF4C8; // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BowFigureColorSet1_124_A608FBC64E1984C4739BFF9CDBD58919; // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BowFigureColorSet2_127_D2D37795461FF304131D8DA705122465; // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BowFigureColorSet3_129_81CEA1E44B91445DFA6D04876E44E37F; // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HullPaintDamageAmount_132_FF02D48F497DFB60C7A00A8C28DDF8FE; // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_ShipTypes                       SelectedShipType_135_3F6EC6E4406E11AD5E1730B0C033979B; // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2894[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FlagSetup_162_1F282424448727C71FBAB4A238FAB50B;    // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SailTearAmount_168_10048221477C12B9AB93E88273FD493E; // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SailPaintWear_170_EF1EFFE74C818EF14DA2F8847BDD2C2F; // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SailDirtAmount_172_7F81415B4148D4188629889CFED65A90; // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


