#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA090 (0xA348 - 0x2B8)
// AnimBlueprintGeneratedClass TreasureTurnInNPC_AnimBP.TreasureTurnInNPC_AnimBP_C
class UTreasureTurnInNPC_AnimBP_C : public UAnimInstance
{
public:
	uint8                                        Pad_2A3B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_134;                      // 0x2C8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_133;                      // 0x3D0(0x108)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x4D8(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0x588(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0x6E0(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_132;                      // 0x708(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_131;                      // 0x810(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_130;                      // 0x918(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_129;                      // 0xA20(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_128;                      // 0xB28(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_127;                      // 0xC30(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0xD38(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0xD58(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_126;                      // 0xD80(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0xE88(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_125;                      // 0xEA8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_124;                      // 0xFB0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_123;                      // 0x10B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_122;                      // 0x11C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_121;                      // 0x12C8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_120;                      // 0x13D0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_119;                      // 0x14D8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_118;                      // 0x15E0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_117;                      // 0x16E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_116;                      // 0x17F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_115;                      // 0x18F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_114;                      // 0x1A00(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_113;                      // 0x1B08(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_112;                      // 0x1C10(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_111;                      // 0x1D18(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_110;                      // 0x1E20(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_109;                      // 0x1F28(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x2030(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x2050(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0x2070(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_108;                      // 0x2098(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_107;                      // 0x21A0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_106;                      // 0x22A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_105;                      // 0x23B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_104;                      // 0x24B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_103;                      // 0x25C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_102;                      // 0x26C8(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x27D0(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0x27F0(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_101;                      // 0x2818(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x2920(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_100;                      // 0x2940(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_99;                       // 0x2A48(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_98;                       // 0x2B50(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_97;                       // 0x2C58(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_96;                       // 0x2D60(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_95;                       // 0x2E68(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_94;                       // 0x2F70(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_93;                       // 0x3078(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_92;                       // 0x3180(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_91;                       // 0x3288(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_90;                       // 0x3390(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_89;                       // 0x3498(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_88;                       // 0x35A0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_87;                       // 0x36A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_86;                       // 0x37B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_85;                       // 0x38B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_84;                       // 0x39C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_83;                       // 0x3AC8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_82;                       // 0x3BD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_81;                       // 0x3CD8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_80;                       // 0x3DE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_79;                       // 0x3EE8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_78;                       // 0x3FF0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_77;                       // 0x40F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_76;                       // 0x4200(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_75;                       // 0x4308(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_74;                       // 0x4410(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_73;                       // 0x4518(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x4620(0x80)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_72;                       // 0x46A0(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x47A8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x47C8(0x20)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x47E8(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x4898(0xB0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_71;                       // 0x4948(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_70;                       // 0x4A50(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x4B58(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4B78(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x4B98(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_69;                       // 0x4BC0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_68;                       // 0x4CC8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_67;                       // 0x4DD0(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4ED8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_66;                       // 0x4EF8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_65;                       // 0x5000(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_64;                       // 0x5108(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_63;                       // 0x5210(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_62;                       // 0x5318(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_61;                       // 0x5420(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_60;                       // 0x5528(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_59;                       // 0x5630(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_58;                       // 0x5738(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x5840(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_57;                       // 0x5868(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_56;                       // 0x5970(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x5A78(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_55;                       // 0x5AA0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_54;                       // 0x5BA8(0x108)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x5CB0(0x158)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x5E08(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_53;                       // 0x5E28(0x108)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x5F30(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x5FF0(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x6148(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x6170(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_52;                       // 0x6198(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_51;                       // 0x62A0(0x108)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x63A8(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_50;                       // 0x63F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_49;                       // 0x64F8(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6600(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x6620(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_48;                       // 0x6648(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_47;                       // 0x6750(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_46;                       // 0x6858(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_45;                       // 0x6960(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_44;                       // 0x6A68(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_43;                       // 0x6B70(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_42;                       // 0x6C78(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x6D80(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x6DA8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x6DD0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x6DF8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x6E20(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x6E48(0x158)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_41;                       // 0x6FA0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_40;                       // 0x70A8(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x71B0(0x80)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_39;                       // 0x7230(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_38;                       // 0x7338(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_37;                       // 0x7440(0x108)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x7548(0xA0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_36;                       // 0x75E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_35;                       // 0x76F0(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x77F8(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x7820(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x7840(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_34;                       // 0x7860(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_33;                       // 0x7968(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x7A70(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x7A90(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_32;                       // 0x7AB8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_31;                       // 0x7BC0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_30;                       // 0x7CC8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_29;                       // 0x7DD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_28;                       // 0x7ED8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_27;                       // 0x7FE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_26;                       // 0x80E8(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x81F0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x8218(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x8240(0x158)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_25;                       // 0x8398(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_24;                       // 0x84A0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_23;                       // 0x85A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_22;                       // 0x86B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_21;                       // 0x87B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_20;                       // 0x88C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_19;                       // 0x89C8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_18;                       // 0x8AD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_17;                       // 0x8BD8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_16;                       // 0x8CE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_15;                       // 0x8DE8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_14;                       // 0x8EF0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13;                       // 0x8FF8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_12;                       // 0x9100(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_11;                       // 0x9208(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_10;                       // 0x9310(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0x9418(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0x9520(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0x9628(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0x9730(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x9838(0x28)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x9860(0x30)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x9890(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0x9998(0x108)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x9AA0(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x9B60(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x9CB8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x9CE0(0x28)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x9D08(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x9D50(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x9EA8(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0x9ED0(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x9FD8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9FF8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0xA018(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0xA120(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0xA228(0x108)(None)
	enum class E_BodyTypes                       BodyType;                                          // 0xA330(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PegLeg;                                            // 0xA331(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A3C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RandomStartPos;                                    // 0xA334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_CharacterFigure                 CharacterFigure;                                   // 0xA338(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseCustomAnimation;                                // 0xA339(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A3D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     CustomAnimation;                                   // 0xA340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTreasureTurnInNPC_AnimBP_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void BlueprintBeginPlay();
	void ExecuteUbergraph_TreasureTurnInNPC_AnimBP(int32 EntryPoint, float CallFunc_RandomFloatInRange_ReturnValue);
};

}


