#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function UI_CategoryButton.UI_CategoryButton_C.PreConstruct
struct UUI_CategoryButton_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x13A8 (0x13A8 - 0x0)
// Function UI_CategoryButton.UI_CategoryButton_C.ExecuteUbergraph_UI_CategoryButton
struct UUI_CategoryButton_C_ExecuteUbergraph_UI_CategoryButton_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2611[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_1;                    // 0x30(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_2;                    // 0x58(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_3;                    // 0x80(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_4;                    // 0xA8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_5;                    // 0xD0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_6;                    // 0xF8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_7;                    // 0x120(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_8;                    // 0x148(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_9;                    // 0x170(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_10;                   // 0x198(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_11;                   // 0x1C0(0x28)(None)
	int32                                        Temp_int_Array_Index_Variable;                     // 0x1E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x1EC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x1F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x1F4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2612[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCanvasPanelSlot*                      CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x1F8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                      CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x200(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_CategoryButton_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x208(0x10)(ReferenceParm, ContainsInstancedReference)
	class UUI_CategoryButton_C*                  CallFunc_Array_Get_Item;                           // 0x218(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x220(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x224(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2613[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush;                      // 0x228(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_1;                    // 0x2B0(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_2;                    // 0x338(0x88)(None)
	struct FButtonStyle                          K2Node_MakeStruct_ButtonStyle;                     // 0x3C0(0x278)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_3;                    // 0x638(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_4;                    // 0x6C0(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_5;                    // 0x748(0x88)(None)
	struct FButtonStyle                          K2Node_MakeStruct_ButtonStyle_1;                   // 0x7D0(0x278)(None)
	struct FSlateSound                           K2Node_MakeStruct_SlateSound;                      // 0xA48(0x18)(NoDestructor)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_6;                    // 0xA60(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_7;                    // 0xAE8(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_8;                    // 0xB70(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_9;                    // 0xBF8(0x88)(None)
	struct FSlateSound                           K2Node_MakeStruct_SlateSound_1;                    // 0xC80(0x18)(NoDestructor)
	struct FButtonStyle                          K2Node_MakeStruct_ButtonStyle_2;                   // 0xC98(0x278)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_10;                   // 0xF10(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_11;                   // 0xF98(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_12;                   // 0x1020(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush_13;                   // 0x10A8(0x88)(None)
	struct FButtonStyle                          K2Node_MakeStruct_ButtonStyle_3;                   // 0x1130(0x278)(None)
};

}
}


