#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x98 (0x2F8 - 0x260)
// WidgetBlueprintGeneratedClass UI_WinningScreen_Trophy.UI_WinningScreen_Trophy_C
class UUI_WinningScreen_Trophy_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      RewardsFadeIn;                                     // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      XPAnim;                                            // 0x270(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                Image_12;                                          // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_13;                                          // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Txt_Player_Name;                                   // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Txt_Points_Description;                            // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Txt_Title;                                         // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class E_ScoreType                       Score_Type;                                        // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3076[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateColor                           Tint;                                              // 0x2A8(0x28)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                            Trophy_Image;                                      // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        HighestScore;                                      // 0x2D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3077[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  PlayerName;                                        // 0x2E0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UUI_WinningScreen_Trophy_C* GetDefaultObj();

	class FText Get_Txt_Player_Name_Text_0();
	void Set_Best_Name(class ABP_PlayerState_C* Player_State, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	class FText Get_Score_Text(enum class E_ScoreType Temp_byte_Variable, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Format_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_3, class FText CallFunc_Format_ReturnValue_2, class FText CallFunc_Format_ReturnValue_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_4, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_5, class FText CallFunc_Format_ReturnValue_4, class FText CallFunc_Format_ReturnValue_5, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_7, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_6, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_7, class FText CallFunc_Format_ReturnValue_6, class FText CallFunc_Format_ReturnValue_7, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_8, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_9, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_8, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_9, class FText CallFunc_Format_ReturnValue_8, class FText CallFunc_Format_ReturnValue_9, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_10, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_11, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_10, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_11, class FText CallFunc_Format_ReturnValue_10, class FText CallFunc_Format_ReturnValue_11, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_12, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_13, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_12, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_13, class FText CallFunc_Format_ReturnValue_12, class FText CallFunc_Format_ReturnValue_13, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_14, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_15, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_14, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_15, class FText CallFunc_Format_ReturnValue_14, class FText CallFunc_Format_ReturnValue_15, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_16, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_17, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_16, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_17, class FText CallFunc_Format_ReturnValue_16, class FText CallFunc_Format_ReturnValue_17, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_18, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_19, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_18, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_19, class FText CallFunc_Format_ReturnValue_18, class FText CallFunc_Format_ReturnValue_19, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_20, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_21, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_20, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_21, class FText CallFunc_Format_ReturnValue_20, class FText CallFunc_Format_ReturnValue_21, bool CallFunc_Greater_IntInt_ReturnValue, class FText K2Node_Select_Default);
	class FText Get_Title(enum class E_ScoreType Temp_byte_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, class FText Temp_text_Variable_7, class FText Temp_text_Variable_8, class FText Temp_text_Variable_9, class FText Temp_text_Variable_10, class FText Temp_text_Variable_11, class FText Temp_text_Variable_12, class FText Temp_text_Variable_13, class FText Temp_text_Variable_14, class FText Temp_text_Variable_15, class FText Temp_text_Variable_16, class FText Temp_text_Variable_17, class FText Temp_text_Variable_18, class FText Temp_text_Variable_19, class FText Temp_text_Variable_20, class FText Temp_text_Variable_21, bool CallFunc_Greater_IntInt_ReturnValue, class FText K2Node_Select_Default);
	void CheckIfSelf(class FText Name, class ABP_PlayerState_C* PlayerState, class FText* Output, bool* IsYou, struct FSlateColor* SelfColor, struct FLinearColor* SelfColor_SpecifiedColor, enum class ESlateColorStylingMode* SelfColor_ColorUseRule, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor_2, const struct FSlateColor& K2Node_MakeStruct_SlateColor_3, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_Controller_C* K2Node_DynamicCast_AsBP_Controller, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_Compare_Teams_Is_Same_Team, bool CallFunc_EqualEqual_TextText_ReturnValue, bool CallFunc_Compare_Crews_Is_Same_Team_And_Crew);
	void Set_Best_Score(class ABP_PlayerState_C* BestInClass, int32 HighestCurrentScore, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AAlpha_Game_State_C* CallFunc_Current_Alpha_Game_State_AsAlpha_Game_State, class APlayerState* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class ABP_PlayerState_C* K2Node_DynamicCast_AsBP_Player_State, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_GetScore_Score, bool CallFunc_Greater_IntInt_ReturnValue);
	void Construct();
	void ExecuteUbergraph_UI_WinningScreen_Trophy(int32 EntryPoint, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
};

}


