#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1D8 (0x3F8 - 0x220)
// BlueprintGeneratedClass WaterSettings.WaterSettings_C
class AWaterSettings_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x220(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x228(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class EWindSpeeds                       WindSpeed;                                         // 0x230(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFetchLengths                     FetchLength;                                       // 0x231(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_331C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NWaves;                                            // 0x234(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NWaves_mod;                                        // 0x238(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NWindSpeeds;                                       // 0x23C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                A;                                                 // 0x240(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K1;                                                // 0x250(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K2;                                                // 0x260(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Omega;                                             // 0x270(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Phi;                                               // 0x280(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        RandomPhaseSeed;                                   // 0x290(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Refresh;                                           // 0x294(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_331D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRandomStream                         RandomStreamPhase;                                 // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	float                                        SeaLevel;                                          // 0x2A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_331E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                A_orig;                                            // 0x2A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        A_Multiplier;                                      // 0x2B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bSeaStateTransition;                               // 0x2BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_331F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                A_Target;                                          // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K1_Target;                                         // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K2_Target;                                         // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Omega_Target;                                      // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Phi_Target;                                        // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                A_Old;                                             // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K1_Old;                                            // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K2_Old;                                            // 0x330(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Omega_Old;                                         // 0x340(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                Phi_Old;                                           // 0x350(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        TransitionStartTime;                               // 0x360(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TransitionEndTime;                                 // 0x364(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                Omega_dot;                                         // 0x368(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        TransitionTime;                                    // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3320[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                K_mag_Old;                                         // 0x380(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K_mag_Target;                                      // 0x390(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K_angle_Old;                                       // 0x3A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                K_angle_Target;                                    // 0x3B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                             CameraLocationStart;                               // 0x3C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bDebug;                                            // 0x3C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3321[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WindSpeed_Target;                                  // 0x3CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FetchLength_Target;                                // 0x3D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WindSpeedCurrent;                                  // 0x3D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FetchLengthCurrent;                                // 0x3D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EWindSpeeds                       WindSpeedTargetEnum;                               // 0x3DC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFetchLengths                     FetchLengthTargetEnum;                             // 0x3DD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3322[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TransitionAlpha;                                   // 0x3E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GameTime;                                          // 0x3E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GameTimeOffset;                                    // 0x3E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3323[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWaterPlane_C*                         WaterPlaneRef;                                     // 0x3F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AWaterSettings_C* GetDefaultObj();

	void ChangeSeaState(enum class EWindSpeeds NewWindSpeed, enum class EFetchLengths NewFetchLength, float TransitionTimeSeconds, const TArray<float>& K_AngleDeltaRad, float AngleTmp, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Array_Index_Variable_2, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, float CallFunc_Conv_StringToFloat_ReturnValue, float CallFunc_Conv_StringToFloat_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable_2, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_4, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_MultiplyByPi_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, float CallFunc_Array_Get_Item, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, float CallFunc_MultiplyByPi_ReturnValue_1, float CallFunc_MultiplyByPi_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_GetPI_ReturnValue, int32 Temp_int_Array_Index_Variable_3, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_Array_Get_Item_1, float CallFunc_Array_Get_Item_2, float CallFunc_Atan2_ReturnValue, float CallFunc_Array_Get_Item_3, float CallFunc_Array_Get_Item_4, float CallFunc_Atan2_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue_2, float CallFunc_Array_Get_Item_5, float CallFunc_Array_Get_Item_6, int32 CallFunc_Array_Length_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, float CallFunc_VSize2D_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_3, float CallFunc_Array_Get_Item_7, float CallFunc_Array_Get_Item_8, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, float CallFunc_VSize2D_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Array_Get_Item_9, float CallFunc_Array_Get_Item_10, float K2Node_MathExpression_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_3, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_5);
	void GenWareParamArrays(TArray<float>& A, TArray<float>& K1, TArray<float>& K2, TArray<float>& Omega, int32 WindSpeedIndex, int32 FetchIndex, int32 IdxTmp, const TArray<float>& Omega_tmp, const TArray<float>& K2_tmp, const TArray<float>& K1_tmp, const TArray<float>& A_tmp, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, float K2Node_MathExpression_ReturnValue, float K2Node_MathExpression_ReturnValue_1, int32 CallFunc_Round_ReturnValue, int32 CallFunc_Round_ReturnValue_1, int32 Temp_int_Variable, const class FString& CallFunc_Conv_IntToString_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, const struct FWaterTableStruct& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_3);
	void GerstnerWaveDeltaQ(int32 WaveIndex, const struct FVector2D& InitialLocation, struct FVector* DeltaOut, struct FVector* Q_Out, float MagK, int32 WaveIndex_loc, float CallFunc_GetScalarParameterValue_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Array_Get_Item, float CallFunc_Array_Get_Item_1, float CallFunc_Array_Get_Item_2, float CallFunc_Array_Get_Item_3, float CallFunc_Array_Get_Item_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_VSize2D_ReturnValue, float CallFunc_DotProduct2D_ReturnValue, float K2Node_MathExpression_ReturnValue, float K2Node_MathExpression_ReturnValue_1, float K2Node_MathExpression_ReturnValue_2, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue, const struct FVector& CallFunc_Conv_Vector2DToVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue);
	void GerstnerWaveDeltaOnly(int32 WaveIndex, const struct FVector2D& InitialLocation, struct FVector* DeltaOut, int32 WaveIndex_loc, float CallFunc_GetScalarParameterValue_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Array_Get_Item, float CallFunc_Array_Get_Item_1, float CallFunc_Array_Get_Item_2, float CallFunc_Array_Get_Item_3, float CallFunc_Array_Get_Item_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_DotProduct2D_ReturnValue, float CallFunc_VSize2D_ReturnValue, float K2Node_MathExpression_ReturnValue, float K2Node_MathExpression_ReturnValue_1, float K2Node_MathExpression_ReturnValue_2, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue, const struct FVector& CallFunc_Conv_Vector2DToVector_ReturnValue);
	void CalculateDeltaOnly(const struct FVector2D& InitialLocation, float ZoneWaterHeight, int32 Accuracy_10Minus28_, struct FVector* Delta, const struct FVector2D& InitLoc, const struct FVector& DeltaTmp, int32 CallFunc_Clamp_ReturnValue, const struct FVector2D& CallFunc_Divide_Vector2DFloat_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, int32 Temp_int_Variable, const struct FVector& CallFunc_GerstnerWaveDeltaOnly_deltaOut, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_GetScalarParameterValue_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1);
	void CalculateDeltaNormal(const struct FVector2D& InitialLocation, int32 Accuracy_10Minus100_, float ZoneWaterHeight, struct FVector* Delta, struct FVector* Normal, const struct FVector2D& InitLoc, const struct FVector& Q_Tmp, const struct FVector& DeltaTmp, float CallFunc_GetScalarParameterValue_ReturnValue, int32 CallFunc_Clamp_ReturnValue, const struct FVector2D& CallFunc_Divide_Vector2DFloat_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& K2Node_MathExpression_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, int32 Temp_int_Variable, const struct FVector& CallFunc_GerstnerWaveDeltaQ_deltaOut, const struct FVector& CallFunc_GerstnerWaveDeltaQ_Q_Out, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ConstructionEvent();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_WaterSettings(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_MultiplyByPi_ReturnValue, int32 CallFunc_FCeil_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue, const struct FRandomStream& CallFunc_MakeRandomStream_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue, float CallFunc_RandomFloatInRangeFromStream_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class AWaterPlane_C*>& CallFunc_GetAllActorsOfClass_OutActors, class AWaterPlane_C* CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, int32 CallFunc_Add_IntInt_ReturnValue_2, float K2Node_Event_DeltaSeconds, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 CallFunc_Array_Length_ReturnValue_2, float CallFunc_Array_Get_Item_1, float CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue, float CallFunc_Array_Get_Item_3, float CallFunc_Array_Get_Item_4, float CallFunc_Array_Get_Item_5, int32 Temp_int_Loop_Counter_Variable_1, float CallFunc_Array_Get_Item_6, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_2, float CallFunc_Array_Get_Item_7, float CallFunc_Array_Get_Item_8, float CallFunc_Array_Get_Item_9, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Array_Get_Item_10, float CallFunc_Array_Get_Item_11, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_2, float K2Node_MathExpression_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float K2Node_MathExpression_ReturnValue_1, int32 Temp_int_Variable, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Array_Index_Variable_3, float CallFunc_Array_Get_Item_12, float CallFunc_Array_Get_Item_13, float CallFunc_Array_Get_Item_14, float CallFunc_Array_Get_Item_15, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, float CallFunc_Conv_StringToFloat_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, float CallFunc_Conv_StringToFloat_ReturnValue_1, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3, float CallFunc_Conv_StringToFloat_ReturnValue_2, float CallFunc_Conv_StringToFloat_ReturnValue_3, float CallFunc_Array_Get_Item_16, float CallFunc_Ease_ReturnValue, float CallFunc_Ease_ReturnValue_1, float CallFunc_Ease_ReturnValue_2, float K2Node_MathExpression_ReturnValue_2, float CallFunc_Ease_ReturnValue_3, float K2Node_MathExpression_ReturnValue_3, float CallFunc_Ease_ReturnValue_4, float CallFunc_GetGameTimeInSeconds_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, float K2Node_MathExpression_ReturnValue_4, float CallFunc_Multiply_FloatFloat_ReturnValue_4, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_3, const struct FTransform& CallFunc_MakeTransform_ReturnValue, int32 Temp_int_Loop_Counter_Variable_3, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_WaterPP_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_6, TArray<class AWaterPlane_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, class AWaterPlane_C* CallFunc_Array_Get_Item_17, bool CallFunc_IsValid_ReturnValue);
};

}


